#pragma once //защита от повторного включения заголовочного файла в один и тот же файл исходного кода
#include <string> //подключаем библиотеку для работы со строками (std::string)

//перечисление всех возможных типов лексем (токенов), которые может распознать наш лексер
enum class TokenType {
    KEYWORD,    //ключевое слово (например, let, func, if)
    IDENTIFIER, //идентификатор (имена переменных, функций, классов)
    NUMBER,     //числовой литерал (целые, с плавающей точкой, шестнадцатеричные и т.д.)
    STRING,     //строковый литерал (текст в кавычках)
    OPERATOR,   //оператор (+, -, ==, ->, ?? и т.д.)
    DELIMITER,  //разделитель ((, ), {, }, ,, ;, :)
    UNKNOWN     //неизвестный символ (ошибка лексического анализа)
};

//структура, описывающая отдельный токен (найденную лексему)
struct Token {
    TokenType type;     //тип токена (из перечисления TokenType выше)
    std::string value;  //текстовое содержимое токена (сам кусок кода)
    std::string file;   //имя файла, в котором был обнаружен этот токен
    int line;           //номер строки в файле, где находится токен
    int column;         //номер символа (колонка) в строке, с которого начинается токен
};